import React from 'react';
import '../css/section-words.css';
import { Button, Table } from 'react-bootstrap';

const SectionWords = () => {
  return (
    <div id="services" className="section-words" style={{ background: 'url(/img/background/section-words.png) center no-repeat', backgroundSize: 'cover' }}>
      <div className="contents">
        <div className="left w-50">
          <div>
            <h2 style={{ fontSize: '48px', fontWeight: 500, lineHeight: '48px' }}>Examples of words that are prohibited but can be changed</h2>
            <p style={{ fontSize: '16px', lineHeight: '32px' }}>
              Et et id laoreet ultricies elementum venenatis ornare. Sollicitudin mauris id aliquet magna adipiscing. In lorem lacus quis egestas tincidunt
              neque ut accumsan.
            </p>
          </div>
          <Button
            className="text-black bg-white font-weight-bold py-2 d-none d-lg-flex justify-content-center align-items-center"
            style={{
              borderRadius: '8px',
              width: '300px',
              height: '59px',
            }}
            type="submit"
          >
            Get Started
            <svg width="15" height="15" viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M7.93335 2L14 7.63333L7.93335 13.2667" stroke="black" strokeWidth="2" strokeLinecap="square" strokeLinejoin="bevel" />
              <path d="M1 7.40123H13.1333" stroke="black" strokeWidth="2" strokeLinecap="square" strokeLinejoin="bevel" />
            </svg>
          </Button>
        </div>
        <div className="right w-50">
          <div className="w-100 text-center d-flex">
            <div className="w-50" style={{ backgroundColor: '#D73433', padding: '7px 10px', fontSize: '24px', fontWeight: '500', borderTopLeftRadius: '1rem' }}>
              คำห้ามใช้
            </div>
            <div
              className="w-50"
              style={{ backgroundColor: '#17AD37', padding: '7px 10px', fontSize: '24px', fontWeight: '500', borderTopRightRadius: '1rem' }}
            >
              คำที่ใช้ได้
            </div>
          </div>
          <div className="word-detail d-flex w-100 bg-white text-blakc flex-wrap">
            <div className="w-50 sub-left">
              <svg width="24" height="25" viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path
                  d="M12 2C6.15 2 1.5 6.65 1.5 12.5C1.5 18.35 6.15 23 12 23C17.85 23 22.5 18.35 22.5 12.5C22.5 6.65 17.85 2 12 2ZM16.05 17.75L12 13.7L7.95 17.75L6.75 16.55L10.8 12.5L6.75 8.45L7.95 7.25L12 11.3L16.05 7.25L17.25 8.45L13.2 12.5L17.25 16.55L16.05 17.75Z"
                  fill="#F5222D"
                />
              </svg>
              <span className="ms-2">ปลอดภัย</span>
            </div>
            <div className="w-50 sub-right">
              <svg width="24" height="25" viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M10.243 16.814L6 12.57L7.414 11.156L10.243 13.984L15.899 8.32703L17.314 9.74203L10.243 16.814Z" fill="#17AD37" />
                <path
                  fillRule="evenodd"
                  clipRule="evenodd"
                  d="M1 12.5C1 6.425 5.925 1.5 12 1.5C18.075 1.5 23 6.425 23 12.5C23 18.575 18.075 23.5 12 23.5C5.925 23.5 1 18.575 1 12.5ZM12 21.5C10.8181 21.5 9.64778 21.2672 8.55585 20.8149C7.46392 20.3626 6.47177 19.6997 5.63604 18.864C4.80031 18.0282 4.13738 17.0361 3.68508 15.9442C3.23279 14.8522 3 13.6819 3 12.5C3 11.3181 3.23279 10.1478 3.68508 9.05585C4.13738 7.96392 4.80031 6.97177 5.63604 6.13604C6.47177 5.30031 7.46392 4.63738 8.55585 4.18508C9.64778 3.73279 10.8181 3.5 12 3.5C14.3869 3.5 16.6761 4.44821 18.364 6.13604C20.0518 7.82387 21 10.1131 21 12.5C21 14.8869 20.0518 17.1761 18.364 18.864C16.6761 20.5518 14.3869 21.5 12 21.5Z"
                  fill="#17AD37"
                />
              </svg>
              <span className="ms-2">ดูแลให้ปลอดภัยได้</span>
            </div>

            <div className="w-50 sub-left">
              <svg width="24" height="25" viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path
                  d="M12 2C6.15 2 1.5 6.65 1.5 12.5C1.5 18.35 6.15 23 12 23C17.85 23 22.5 18.35 22.5 12.5C22.5 6.65 17.85 2 12 2ZM16.05 17.75L12 13.7L7.95 17.75L6.75 16.55L10.8 12.5L6.75 8.45L7.95 7.25L12 11.3L16.05 7.25L17.25 8.45L13.2 12.5L17.25 16.55L16.05 17.75Z"
                  fill="#F5222D"
                />
              </svg>
              <span className="ms-2">เหมือนดาราเกาหลี</span>
            </div>
            <div className="w-50 sub-right">
              <svg width="24" height="25" viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M10.243 16.814L6 12.57L7.414 11.156L10.243 13.984L15.899 8.32703L17.314 9.74203L10.243 16.814Z" fill="#17AD37" />
                <path
                  fillRule="evenodd"
                  clipRule="evenodd"
                  d="M1 12.5C1 6.425 5.925 1.5 12 1.5C18.075 1.5 23 6.425 23 12.5C23 18.575 18.075 23.5 12 23.5C5.925 23.5 1 18.575 1 12.5ZM12 21.5C10.8181 21.5 9.64778 21.2672 8.55585 20.8149C7.46392 20.3626 6.47177 19.6997 5.63604 18.864C4.80031 18.0282 4.13738 17.0361 3.68508 15.9442C3.23279 14.8522 3 13.6819 3 12.5C3 11.3181 3.23279 10.1478 3.68508 9.05585C4.13738 7.96392 4.80031 6.97177 5.63604 6.13604C6.47177 5.30031 7.46392 4.63738 8.55585 4.18508C9.64778 3.73279 10.8181 3.5 12 3.5C14.3869 3.5 16.6761 4.44821 18.364 6.13604C20.0518 7.82387 21 10.1131 21 12.5C21 14.8869 20.0518 17.1761 18.364 18.864C16.6761 20.5518 14.3869 21.5 12 21.5Z"
                  fill="#17AD37"
                />
              </svg>
              <span className="ms-2">คล้าย</span>
            </div>

            <div className="w-50 sub-left">
              <svg width="24" height="25" viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path
                  d="M12 2C6.15 2 1.5 6.65 1.5 12.5C1.5 18.35 6.15 23 12 23C17.85 23 22.5 18.35 22.5 12.5C22.5 6.65 17.85 2 12 2ZM16.05 17.75L12 13.7L7.95 17.75L6.75 16.55L10.8 12.5L6.75 8.45L7.95 7.25L12 11.3L16.05 7.25L17.25 8.45L13.2 12.5L17.25 16.55L16.05 17.75Z"
                  fill="#F5222D"
                />
              </svg>
              <span className="ms-2">ถึง 99.9%</span>
            </div>
            <div className="w-50 sub-right">
              <svg width="24" height="25" viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M10.243 16.814L6 12.57L7.414 11.156L10.243 13.984L15.899 8.32703L17.314 9.74203L10.243 16.814Z" fill="#17AD37" />
                <path
                  fillRule="evenodd"
                  clipRule="evenodd"
                  d="M1 12.5C1 6.425 5.925 1.5 12 1.5C18.075 1.5 23 6.425 23 12.5C23 18.575 18.075 23.5 12 23.5C5.925 23.5 1 18.575 1 12.5ZM12 21.5C10.8181 21.5 9.64778 21.2672 8.55585 20.8149C7.46392 20.3626 6.47177 19.6997 5.63604 18.864C4.80031 18.0282 4.13738 17.0361 3.68508 15.9442C3.23279 14.8522 3 13.6819 3 12.5C3 11.3181 3.23279 10.1478 3.68508 9.05585C4.13738 7.96392 4.80031 6.97177 5.63604 6.13604C6.47177 5.30031 7.46392 4.63738 8.55585 4.18508C9.64778 3.73279 10.8181 3.5 12 3.5C14.3869 3.5 16.6761 4.44821 18.364 6.13604C20.0518 7.82387 21 10.1131 21 12.5C21 14.8869 20.0518 17.1761 18.364 18.864C16.6761 20.5518 14.3869 21.5 12 21.5Z"
                  fill="#17AD37"
                />
              </svg>
              <span className="ms-2">รักษาสิวได้ 99.9%</span>
            </div>

            <div className="w-50 sub-left">
              <svg width="24" height="25" viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path
                  d="M12 2C6.15 2 1.5 6.65 1.5 12.5C1.5 18.35 6.15 23 12 23C17.85 23 22.5 18.35 22.5 12.5C22.5 6.65 17.85 2 12 2ZM16.05 17.75L12 13.7L7.95 17.75L6.75 16.55L10.8 12.5L6.75 8.45L7.95 7.25L12 11.3L16.05 7.25L17.25 8.45L13.2 12.5L17.25 16.55L16.05 17.75Z"
                  fill="#F5222D"
                />
              </svg>
              <span className="ms-2">แบบเกาหลี/แบบ</span>
            </div>
            <div className="w-50 sub-right">
              <svg width="24" height="25" viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M10.243 16.814L6 12.57L7.414 11.156L10.243 13.984L15.899 8.32703L17.314 9.74203L10.243 16.814Z" fill="#17AD37" />
                <path
                  fillRule="evenodd"
                  clipRule="evenodd"
                  d="M1 12.5C1 6.425 5.925 1.5 12 1.5C18.075 1.5 23 6.425 23 12.5C23 18.575 18.075 23.5 12 23.5C5.925 23.5 1 18.575 1 12.5ZM12 21.5C10.8181 21.5 9.64778 21.2672 8.55585 20.8149C7.46392 20.3626 6.47177 19.6997 5.63604 18.864C4.80031 18.0282 4.13738 17.0361 3.68508 15.9442C3.23279 14.8522 3 13.6819 3 12.5C3 11.3181 3.23279 10.1478 3.68508 9.05585C4.13738 7.96392 4.80031 6.97177 5.63604 6.13604C6.47177 5.30031 7.46392 4.63738 8.55585 4.18508C9.64778 3.73279 10.8181 3.5 12 3.5C14.3869 3.5 16.6761 4.44821 18.364 6.13604C20.0518 7.82387 21 10.1131 21 12.5C21 14.8869 20.0518 17.1761 18.364 18.864C16.6761 20.5518 14.3869 21.5 12 21.5Z"
                  fill="#17AD37"
                />
              </svg>
              <span className="ms-2">สไตล์เกาหลี</span>
            </div>

            <div className="w-50 sub-left">
              <svg width="24" height="25" viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path
                  d="M12 2C6.15 2 1.5 6.65 1.5 12.5C1.5 18.35 6.15 23 12 23C17.85 23 22.5 18.35 22.5 12.5C22.5 6.65 17.85 2 12 2ZM16.05 17.75L12 13.7L7.95 17.75L6.75 16.55L10.8 12.5L6.75 8.45L7.95 7.25L12 11.3L16.05 7.25L17.25 8.45L13.2 12.5L17.25 16.55L16.05 17.75Z"
                  fill="#F5222D"
                />
              </svg>
              <span className="ms-2">ฆ่าเชื้อสิว</span>
            </div>
            <div className="w-50 sub-right">
              <svg width="24" height="25" viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M10.243 16.814L6 12.57L7.414 11.156L10.243 13.984L15.899 8.32703L17.314 9.74203L10.243 16.814Z" fill="#17AD37" />
                <path
                  fillRule="evenodd"
                  clipRule="evenodd"
                  d="M1 12.5C1 6.425 5.925 1.5 12 1.5C18.075 1.5 23 6.425 23 12.5C23 18.575 18.075 23.5 12 23.5C5.925 23.5 1 18.575 1 12.5ZM12 21.5C10.8181 21.5 9.64778 21.2672 8.55585 20.8149C7.46392 20.3626 6.47177 19.6997 5.63604 18.864C4.80031 18.0282 4.13738 17.0361 3.68508 15.9442C3.23279 14.8522 3 13.6819 3 12.5C3 11.3181 3.23279 10.1478 3.68508 9.05585C4.13738 7.96392 4.80031 6.97177 5.63604 6.13604C6.47177 5.30031 7.46392 4.63738 8.55585 4.18508C9.64778 3.73279 10.8181 3.5 12 3.5C14.3869 3.5 16.6761 4.44821 18.364 6.13604C20.0518 7.82387 21 10.1131 21 12.5C21 14.8869 20.0518 17.1761 18.364 18.864C16.6761 20.5518 14.3869 21.5 12 21.5Z"
                  fill="#17AD37"
                />
              </svg>
              <span className="ms-2">รักษาสิว</span>
            </div>

            <div className="w-50 sub-left">
              <svg width="24" height="25" viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path
                  d="M12 2C6.15 2 1.5 6.65 1.5 12.5C1.5 18.35 6.15 23 12 23C17.85 23 22.5 18.35 22.5 12.5C22.5 6.65 17.85 2 12 2ZM16.05 17.75L12 13.7L7.95 17.75L6.75 16.55L10.8 12.5L6.75 8.45L7.95 7.25L12 11.3L16.05 7.25L17.25 8.45L13.2 12.5L17.25 16.55L16.05 17.75Z"
                  fill="#F5222D"
                />
              </svg>
              <span className="ms-2">เริ่มต้น (ราคาเริ่มต้น)</span>
            </div>
            <div className="w-50 sub-right">
              <svg width="24" height="25" viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M10.243 16.814L6 12.57L7.414 11.156L10.243 13.984L15.899 8.32703L17.314 9.74203L10.243 16.814Z" fill="#17AD37" />
                <path
                  fillRule="evenodd"
                  clipRule="evenodd"
                  d="M1 12.5C1 6.425 5.925 1.5 12 1.5C18.075 1.5 23 6.425 23 12.5C23 18.575 18.075 23.5 12 23.5C5.925 23.5 1 18.575 1 12.5ZM12 21.5C10.8181 21.5 9.64778 21.2672 8.55585 20.8149C7.46392 20.3626 6.47177 19.6997 5.63604 18.864C4.80031 18.0282 4.13738 17.0361 3.68508 15.9442C3.23279 14.8522 3 13.6819 3 12.5C3 11.3181 3.23279 10.1478 3.68508 9.05585C4.13738 7.96392 4.80031 6.97177 5.63604 6.13604C6.47177 5.30031 7.46392 4.63738 8.55585 4.18508C9.64778 3.73279 10.8181 3.5 12 3.5C14.3869 3.5 16.6761 4.44821 18.364 6.13604C20.0518 7.82387 21 10.1131 21 12.5C21 14.8869 20.0518 17.1761 18.364 18.864C16.6761 20.5518 14.3869 21.5 12 21.5Z"
                  fill="#17AD37"
                />
              </svg>
              <span className="ms-2">เพียง</span>
            </div>
          </div>
        </div>
        <Button
          className="text-white mt-2 font-weight-bold py-2 d-flex fs-24 d-lg-none justify-content-center align-items-center"
          style={{
            fontSize: '24px',
            fontWeight: 400,
            borderRadius: '8px',
            width: '300px',
            height: '59px',
            backgroundColor: '#CB0C9F',
          }}
          type="submit"
        >
          Get Started
          <svg width="49" height="48" viewBox="0 0 49 48" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path
              d="M11.0003 24.1999C11.0003 23.7892 11.1583 23.3954 11.4396 23.105C11.7209 22.8146 12.1025 22.6515 12.5003 22.6515L32.8853 22.6515L30.9353 20.6541C30.6528 20.3625 30.4941 19.9671 30.4941 19.5547C30.4941 19.1424 30.6528 18.7469 30.9353 18.4554C31.2177 18.1638 31.6008 18 32.0003 18C32.3997 18 32.7828 18.1638 33.0653 18.4554L37.5653 23.1005C37.7734 23.3183 37.9144 23.5948 37.9705 23.8951C38.0265 24.1955 37.9951 24.5063 37.8803 24.7883C37.7677 25.071 37.5767 25.3131 37.3311 25.4839C37.0855 25.6548 36.7964 25.7467 36.5003 25.7483L12.5003 25.7483C12.1025 25.7483 11.7209 25.5851 11.4396 25.2948C11.1583 25.0044 11.0003 24.6105 11.0003 24.1999Z"
              fill="white"
            />
            <path
              d="M30.4997 28.8449C30.4986 28.6411 30.5364 28.4391 30.6111 28.2505C30.6857 28.0618 30.7957 27.8902 30.9347 27.7455L35.4347 23.1004C35.7172 22.8088 36.1003 22.645 36.4997 22.645C36.6975 22.645 36.8934 22.6852 37.0761 22.7634C37.2588 22.8415 37.4249 22.956 37.5647 23.1004C37.7046 23.2448 37.8155 23.4161 37.8912 23.6048C37.9669 23.7934 38.0059 23.9956 38.0059 24.1997C38.0059 24.6121 37.8472 25.0075 37.5647 25.2991L33.0647 29.9443C32.9253 30.0894 32.7594 30.2046 32.5766 30.2832C32.3938 30.3618 32.1977 30.4023 31.9997 30.4023C31.8017 30.4023 31.6056 30.3618 31.4229 30.2832C31.2401 30.2046 31.0742 30.0894 30.9347 29.9443C30.7957 29.7996 30.6857 29.628 30.6111 29.4393C30.5364 29.2507 30.4986 29.0487 30.4997 28.8449Z"
              fill="white"
            />
          </svg>
        </Button>
      </div>
    </div>
  );
};

export default SectionWords;
